#+TITLE: Matasa, septembre 2024
#+AUTHOR: CCA
#+STARTUP: content
#+OPTIONS: toc:nil num:nil

** Surligne les nombres
#+begin_src emacs-lisp
  (use-package highlight-numbers)
  (add-hook 'prog-mode-hook 'highlight-numbers-mode)
#+end_src

#+RESULTS:
| highlight-numbers-mode |

* org-babel
#+begin_src emacs-lisp
(use-package ob-mongo)
#+end_src

#+begin_src emacs-lisp
(use-package ob-php)
#+end_src

#+begin_src emacs-lisp
(use-package ob-prolog)
#+end_src

#+begin_src emacs-lisp
(use-package ob-typescript)
#+end_src

#+begin_src emacs-lisp
(org-babel-do-load-languages 'org-babel-load-languages
                             '(
			       (C . t)
                               (R . t)
                               (awk . t)
                               (clojure    . t)
                               (dot . t)
			       (emacs-lisp . t)
			       (gnuplot . t)
                               (haskell   . t)
			       ;;(http . t)
                               (java  . t)
                               (js     . t)
                               (latex . t)
                               (lilypond . t)
                               (lisp   . t)
                               (perl . t)
                               (php . t)
                               (plantuml . t)
                               (prolog . t)
                               (python . t)
                               (restclient . t)
                               (ruby . t)
			       (sass . t)
                               (scheme . t)
                               (shell  . t)
                               (sql    . t)
			       (sqlite . t)
			       (typescript . t)
                               ;;(csharp . t)
                               ;;(ein    . t)
                               ;;(jupyter . t)
                               ;;(scala . t)
                               ))
(setq org-confirm-babel-evaluate nil)
;; https://sachachua.com/dotemacs => Diagrams and graphics
(add-to-list 'org-src-lang-modes '("dot" . graphviz-dot))
#+end_src

#+RESULTS:
: ((dot . graphviz-dot) (php . php) (mongo . js) (C . c) (C++ . c++) (asymptote . asy) (bash . sh) (beamer . latex) (calc . fundamental) (cpp . c++) (ditaa . artist) (desktop . conf-desktop) (dot . fundamental) (elisp . emacs-lisp) (ocaml . tuareg) (screen . shell-script) (shell . sh) (sqlite . sql) (toml . conf-toml))

#+begin_src emacs-lisp
;; (org-babel-do-load-languages
;;  'org-babel-load-languages
;;  '((python . t)
;;    (shell . t)
;;    (emacs-lisp . t)
;;    (ditaa . t)
;;    (awk . t)
;;    (http . t)
;;    ))
#+end_src
* lsp-origami


#+begin_src emacs-lisp
(use-package origami
  :config (global-origami-mode))
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
(use-package lsp-origami
  :hook ((lsp-after-open . lsp-origami-mode)))
#+end_src

#+RESULTS:
| lsp-origami-mode | doom-modeline-update-lsp |

#+begin_src emacs-lisp
;; (use-package lsp-origami
;;   :ensure t)

;; (add-hook 'lsp-after-open-hook #'lsp-origami-try-enable)
#+end_src

#+RESULTS:
| lsp-origami-try-enable | dap-ui--after-open | dap--after-open | doom-modeline-update-lsp |

* python
#+begin_src emacs-lisp
  (use-package python-mode
    :ensure t
    :hook (python-mode . lsp-deferred)
    :custom
    ;; NOTE: Set these if Python 3 is called "python3" on your system!
    (python-shell-interpreter "python3")
    (dap-python-executable "python3")
    (dap-python-debugger 'debugpy)
    :config
    (require 'dap-python))
#+end_src

#+RESULTS:
| lsp-deferred | doom-modeline-env-setup-python |

#+begin_src emacs-lisp
(use-package pyvenv
  :ensure t
  :config (pyvenv-mode t)
  ;; Set correct Python interpreter
  (setq pyvenv-post-activate-hooks
        (list (lambda ()
                (setq python-shell-interpreter (concat pyvenv-virtual-env "bin/python3")))))
  (setq pyvenv-post-deactivate-hooks
        (list (lambda ()
                (setq python-shell-interpreter "python3")))))
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
  (setq org-babel-python-command "python3")
  (setq org-babel-default-header-args:python
		'((:results . "output")
	  (:session . "none")
	  (:shebang . "#!/usr/bin/env python3")
	  (:flags  . "-i")))

#+end_src

#+RESULTS:
: ((:results . output) (:session . none) (:shebang . #!/usr/bin/env python3) (:flags . -i))

#+begin_src emacs-lisp
  (setq python-shell-completion-native-enable nil)
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
;; active cet environnement virtuel par défaut
;;(pyvenv-activate "~/envirs/env02/")
#+end_src

#+RESULTS:

